
## Plan Result (terraform/settings)

[CI link](https://github.com/air-hand/dotfiles/actions/runs/9838979230)


<pre><code>Plan: 3 to import, 1 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * github_issue_label.dependencies[&#34;major&#34;]
* Update
  * github_issue_label.dependencies[&#34;dependencies&#34;]
  * github_issue_label.dependencies[&#34;minor&#34;]
  * github_issue_label.dependencies[&#34;patch&#34;]
* Import
  * github_issue_label.dependencies[&#34;dependencies&#34;]
  * github_issue_label.dependencies[&#34;minor&#34;]
  * github_issue_label.dependencies[&#34;patch&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # github_issue_label.dependencies["dependencies"] will be updated in-place
  # (imported from "dotfiles:dependencies")
  ~ resource "github_issue_label" "dependencies" {
      ~ color       = "0366d6" -> "CCCCCC"
      - description = "Pull requests that update a dependency file" -> null
        etag        = "W/\"51fc4d2f8a978614f5d19c5130e3c4e8e1768f827b495e16ce4490ed3d2e301e\""
        id          = "dotfiles:dependencies"
        name        = "dependencies"
        repository  = "dotfiles"
        url         = "https://api.github.com/repos/air-hand/dotfiles/labels/dependencies"
    }

  # github_issue_label.dependencies["major"] will be created
  + resource "github_issue_label" "dependencies" {
      + color      = "FF0000"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "major"
      + repository = "dotfiles"
      + url        = (known after apply)
    }

  # github_issue_label.dependencies["minor"] will be updated in-place
  # (imported from "dotfiles:minor")
  ~ resource "github_issue_label" "dependencies" {
      ~ color       = "ededed" -> "00FF00"
        description = null
        etag        = "W/\"c493606841271b1d985e76bf1420c9d1e036b433a98c646f04fffb4a176fbe7c\""
        id          = "dotfiles:minor"
        name        = "minor"
        repository  = "dotfiles"
        url         = "https://api.github.com/repos/air-hand/dotfiles/labels/minor"
    }

  # github_issue_label.dependencies["patch"] will be updated in-place
  # (imported from "dotfiles:patch")
  ~ resource "github_issue_label" "dependencies" {
      ~ color       = "ededed" -> "0000FF"
        description = null
        etag        = "W/\"0dcd3b92c44e713d2e5b182617fe940d396c1b3b3bc667491e9ae5ca3f95e353\""
        id          = "dotfiles:patch"
        name        = "patch"
        repository  = "dotfiles"
        url         = "https://api.github.com/repos/air-hand/dotfiles/labels/patch"
    }

Plan: 3 to import, 1 to add, 3 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":159,"Program":"tfcmt","SHA1":"839d7d30af366fd5ec457657c0d2b71ae700830d","Target":"terraform/settings","Vars":{},"WorkflowName":"Terraform plan and apply"} -->